app/controllers/main_controller.rb

  def index
    @top_posts = Post.top.page(params[:page] || 1).per(10)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`deleted_at` IS NULL ORDER BY `posts`.`id` DESC LIMIT 10